"""
    Файл с функцией преобразования названия города, грамотное
    написание которого необходимо для работы API OpenWeatherMap,
    а также функцией получения даты и перевода из формата ДД.ММ.ГГ
    в родительный падеж
"""

from datetime import datetime


def true_city(s):
    s = s.strip()  # убираем лишние пробелы
    s = s.lower()  # переводим строку в нижний регистр
    s = s.title()  # меняем первые буквы слов на заглавные
    s = s.replace(' ', '-')  # меняем пробел на тире
    return s


# Текущая дата
date = datetime.now()

# Словарь месяцев (в родительном падеже)
months = {
    1: "января", 2: "февраля", 3: "марта", 4: "апреля",
    5: "мая", 6: "июня", 7: "июля", 8: "августа",
    9: "сентября", 10: "октября", 11: "ноября", 12: "декабря"
}

today = f"{date.day} {months[date.month]}"


if __name__ == "__main__":
    print(true_city(' саНтк-петЕрБург '))  # вывод: Санкт-Петербург
    print(today)  # сегодня
